<?php

$players = [
    [
        "順位" => 1,
        "選手名" => "山本",
        "チーム名" => "ドジャース",
        "防御率" => 1.80
    ],
    [
        "順位" => 2,
        "選手名" => "ルサルド",
        "チーム名" => "フィリーズ",
        "防御率" => 2.11
    ],
    [
        "順位" => 3,
        "選手名" => "ペラルタ",
        "チーム名" => "ブリュワーズ",
        "防御率" => 2.18
    ],
    [
        "順位" => 4,
        "選手名" => "キング",
        "チーム名" => "パドレス",
        "防御率" => 2.22
    ],
    [
        "順位" => 5,
        "選手名" => "キャニング",
        "チーム名" => "メッツ",
        "防御率" => 2.357
    ],
];

// 確認のため出力
// print_r($players);


// 選手名だけを出力
foreach ($players as $player) {
    echo $player["選手名"] . "<br>";
}


// 防護率が2.2以下の選手を出力
foreach ($players as $player) {      // 何回ループしているか　５回（foreach文のplayers(配列)の要素の分だけ）
    if ($player["防御率"] <= 2.2) {     // asのあとのplayersは、playersの要素を一つずつ取り出してくるため
        echo $player["選手名"] . "<br>";
    }
}

?>

<br>



<?php

$sanrio_characters = [
    [
        "name" => "ハローキティ",
        "age" => "5",
        "team" => "サンリオ"
    ],
    [
        "name" => "マイメロディ",
        "age" => "6",
        "team" => "サンリオ"
    ],
    [
        "name" => "シナモロール",
        "age" => "7",
        "team" => "サンリオ"
    ],
    [
        "name" => "ポムポムプリン",
        "age" => "8",
        "team" => "サンリオ"
    ],
    [
        "name" => "ぐでたま",
        "age" => "9",
        "team" => "サンリオ"
    ]
];


// 名前を出力
foreach ($sanrio_characters as $character) {
    echo $character["name"] . "<br>";
}
